# ერთნაირ ფუნქციას გაიტანს სახელს უწოდებს და გამოვიყენებთ
'''
პითონს აქვს ჩაშენებული ფუნქციები
მაგრამ საჭიროა ჩვენი ფუნქციები შევქმნათ
'''
# ფუნქციის ტანი
# def  function_name():
# ნებისმიერი ლოგიკა
# --------------------------------------------


def hell():
    print("hello,David")


hell()

# -----------------------------------------


def hello():
    # i არის ლოკალური ცვლადი და ვერ დაბეჭდავს მის მნიშვნელობას
    # იქამდე სანამ def ფუნქციის ბლოკს არ გასცდება
    i = 1
    # დააბრუნე i=1 და ისე განაგრძე
    return i


hello()
# დაბეჭდე 2+ამ ფუნქციის პასუხის მნიშვნელობა
print(2+hello())
# -----------------------------------------
# y მოდის კუბის შემსვლელ კარში


def cube(x):
    # x არის პარამეტრი რომელშიც y ავიდა მესამე ხარისხში
    return x ** 3


#  y ში შეიყვანს რაიმე მთელ რიცხვს მომხმარებელი
y = int(input("please enter the number:"))
# კუბის ფუნქციის გამოძახებისას გავუშვათ y არგუმენტს ვუგზავნით
print(cube(y))
# ბოლოს მღებული რიცხვი დაბრუნდა პრინტში და გამოვიდა
# -----------------------------------------


def calculate(a, b):

    jami = a+b
    sxvaoba = a-b
    namravli = a*b
    gayofa = a/b
    return jami, sxvaoba, namravli, gayofa


x = int(input("input x:"))
y = int(input("input y:"))
print(calculate(x, y))
# -----------------------------------------
# თუ ბ მნიშვნელობა არიქნა არჩეული (დეფოლტზე ეყენოს 2)


def calc(a, b=2):

    jami = a+b
    sxvaoba = a-b
    namravli = a*b
    gayofa = a/b
    return jami, sxvaoba, namravli, gayofa


x = int(input("input x:"))
# თუ print(calc(x,y)) 'y' ის მნიშვნელობა დაჯდება b ზე და გაუქმდება b
print(calc(x))
# -----------------------------------------
# კარი ეკითხება სახელს და რიცხვს


def humanage(name, birthdate):
    year = 2020
    # ამზადებს დაბეჭდილ სახელს
    print(name)
    # ამზადებს ასაკს
    return year-birthdate


# სთხოვს შეიყვანოს წელი და გადასცემს შუამავალს
birthdate = int(input("დაბადების წელი:"))
# უგზავნის დეფოლტ სახელს და დაბადების თარიღს კარს
print(humanage(name="David", birthdate=birthdate))
