'მასივები''სიები'
' თვის განმავლობაში თითოეული დღის ტემპერატურა '
t = 22
t1 = 24
t3 = 17
# სიის შექმნა
temo = [22, 24, 17]
# ცარიელი სია
a = []
# გამოძახება
type(a)
b = list()
type(b)
'სიებში შესაძლებელია მონაცემების ტიპების არევა int, list, bool... '
c = [12, 45.23, True, "text", [1, 2]]
print(c)
# თითოს გამოძახება
print(c[3])
'----------------------------------------'
# ბოლო ელემენტის გამოძახება
print(c[-1])
print(c[-2])
# ნულოვანი
print(c[0])
'პირველი ჩამონათვალიდან, რადგან 0 დან ითვლის'
a = [1, 2]
b = ["a", "b"]
c = a+b
print(c)
d = a*3
print(d)
'e=a*2.3 არ შეიძლება'
# შედის თუ არა მნიშვნელობა სიაში
print(2 in c)
'----------------------------------------'
x = [1, 2, 3, 4, 5, 6, 7, 8, 9, ]
'დაწყება'
print(x[4:])  # a[start]
'დაწყება და დასრულება'
print(x[2:8])  # a[start:end]
'0 დან დაიწყე ": :" ბოლომდე, 2 ის გამოტოვებით  '
print(x[0::2])   # a[ start:end:step]
'0 ის მითითება არაა საჭირო დასაწყისის საჩვენებლად,  ისეც შეიძლება'
print(x[::2])   # a[ start:end:step]
'დაიწყე და ჩაყევე ოღონდ უკუღმა'
print(x[::-1])
'მატრიცებთან სამუშაოდ შეგვიძლია გამოვიყენოთ'
a = [1, 2]  # აში შედის 1,2
b = a  # ბეში შედის ა ს 1,2
'აც შეიცვლება'
b[1] = 3  # ბედან შეიცვალა ას ელემენტი 1>3
c = a.copy()  # ც ში ჩააკოპირებს ას 1,2
c[0] = 2
d = a[:]  # d ში ჩააკოპირებს ას ელემენტებსს
d[1] = 7
print(d, c, a)
# ჩაშენებული სია
#    0      1
#   0 1    0  1
x = [[1, 2], [6, 7]]
print(x[0], "x[0]")
print(x[1][1], "x[1][1]")  # '7'
print(x[0][0], "x[0][0]")  # '1'
# შედარება
print([1, 2] > [0, 7])
