'N19. სიების მეთოდები და ფუნქციები'
a = [1, 2, 3, 4, 5, 6, 7, 8, 9]
'''
len(a) სიაში ელემენტების რაოდენობა
max(a) მაქსიმალ
min(a) მინიმალ
sum(a) ჯამი
sorted(a) სორტირება
sorted(a, reverse= True) შეტრიალებული სორტირება
sum(a)/len(a)  საშუალო არითმეტიკული
'''
'-----------------------------------------'
print(len(a))  # სიაში ელემენტების რაოდენობა
print(max(a))  # მაქსიმალ
print(min(a))  # მინიმალ
print(sum(a))  # ჯამი
print(sorted(a))  # სორტირება
print(sorted(a, reverse=True))  # შეტრიალებული სორტირება
print(sum(a)/len(a))  # საშუალო არითმეტიკული
'-----------------------------------------------'
# სიის მეთოდები 'აუცილებლად სიები უნდა ჩაიწეროს [] ში'
b = [3, 4, 4, 2, 5, 8, 9]
b.clear()  # შლის
print(b)
print(" zevit washlilia")
b.append(4)  # 'დავამატოთ მონაცემები სიის ბოლოს'
b.append(4)
b.append(4), b.append(4)
print(b)
print(b.count(4))
'ითვლის  არჩეულ ელემენტს'
b.extend(a)  # b ელემენტებს დაუმატა a ელემენტები
print(b)

print(a.index(5, 3))  # სადაა ელემენტის
print(a.index(4, 2, 5))  # 4 იანი 2 დან 5 მდე ეძებეო
a.insert(0, 100)  # პირველ პოზიციაზე ჩასვი 100, რადგან 0,1,2,3 პოზიციები
print(a)
print(a.pop())  # ბოლო ელემენტს შლის და ბეჭდავს
print(a.pop(1))  # პირველი წაშალა და გამოიტანა
a.remove(4)  # 4 იანებს გააქრობს
print(a)
a.reverse()  # შეამოატრიალა და დაამახსოვრა
print(a)
a.reverse()
print(a)
print(sorted(a))
print(a)
#  ალაგებს, არ ამახსოვრებს
a.sort()
print("----------")
print(a)  # ალაგებს, იმახსოვრებს
print("daimaxsovra sorti")
'-----------------------------------------------'
