'try except'
'პრობლემების გამოჭრა'
'შეცდომის გამოვლენა'
'გვერდი აუაროს შეცდომას და სხვა ოპერაციები გააგრძელოს'
'---------------------------------------------------------'
'''
try :
-------თუ ყველაფერი რიგზეა------------
    " ყველაფერი რაც ჩართავს გაუშვებს კოდს"
except:
-------თუ არმუშაობს ასრულებს გამოჭერის კოდს--------
    "ყველა გამონაკლის გამოტოვების კოდი"
else:
-------თუ წარმატებით მუშაობს try ელსიც აკეთებს რაღაცას------------------
    "არარის გამონაკლისი? გაუშვი კოდი"
finally:
-------ნებისმიერ შემთხვევაში გაუშვი კოდი მიუხედავად try, except, else---------
    "ყოველთვის გაუშვი კოდი"

'''

try:
    x = int(input("x:"))
except:
    x = 10
try:
    y = int(input("y:"))
except:
    x = 1
# თუ შეიყვანა 9/0 შეცდომა იქნება
try:  # მოსინჯოს ფორმულა
    result = x/y  # ხუფი  სადაც იწერება მიღების ლოგიკა
except:
    result = 0  # თუ შეიყვანა 9/0 და "შეცდომა იქნება", მაშინ მიიღოს მნიშვნელობა 0
print(result)

x = 4
y = "as"
try:
    print(x/y)  # ვერ გაყო
except TypeError:
    try:  # თაიპერორს იჭერს თუ არის ასეთი'
        y = int(y)  # დავაკონვერტირე ინტეჯერით "ტიპების პრობლემა"
        print(x/y)  # თუ გამოსწორდა მერე შევასრულე
    except ValueError:   # ველიუერორს იჭერს თუ არის ასეთი
        print(0)  # დაბეჭდე 0
'-------------------------------------------------------------'


def cube(x):
    try:
        x = int(x)
        return x**3  # გამოიტანოს კუბი
    except Exception as e:  # გამოიჭირე  და ჩააგდე e ცვლადში შეცდომის მიზეზი

        # Errors and exceprions link https://docs.python.org/3/tutorial/errors.html:

        print(e)
        return 0     # გამოიტანოს 0


print(cube("asdf"))

'-------------------------------------------------------'
x = 10
y = 5
try:
    print(x/y)
except:
    print(0)
else:
    print(x, y)
finally:
    print("I don't care!")
'----------------------------------------------------------'
