# N5 პირობის ოპერატორები (if, elif, else)

# ( if  თუ პირობა:[ შედეგი ] )
# ( if  თუ პირობა:[ შედეგი ]   / elif თუ პირობა2: [შედეგი] )
# ( if თუ პირობა: [შედეგი ] ~ else ყველა სხვა დანარჩენი: [შედეგი] )
# ( if  თუ პირობა: [შედეგი ] / elif თუ პირობა2: [შედეგი]  )~ else ყველა სხვა: [შედეგი]
# ----------------------------------------

x = int(input("შეიყვანე რიცხვი:"))
if x == 7:
    print("x=7")
elif x > 7:

    print("x>7")
else:
    print("x უარყოფითია")

# ----------------------------------------
