# N7. ციკლის ოპერატორები (for ციკლი)
'''
დაკომენტარება ძალიან კარგი არის კოდის წერისას
სამი ზედა წერტილით ხდება კომენტარის დატოვა
კომენტარის ბოლოს უნდა დაიხუროს სამი ზედა წერტილით
'''
# for loop
'ერთი ნაბიჯით გადაადგილება თითოეულ წრეზე'
print('START')
# N1
for i in range(3):
    print(i)
    # 0 დან 3 მდე, 2 ის ჩათვლით წერს რიცხვებს
print('0,1,2')
# N2
for i in range(1, 4):
    print(i)
    # 1 დან 4 მდე წერს

print('1,2,3')
# N3
for i in range(0, 6, 2):
    print(i)
    # 0 დან 4 მდე 2 რიცხვის გამოტოვებით
print('0,2,4')
'''
#end დაბოლოვება
N1
for i in range (END):
    ...
#დაწყება დასრულება
N2
for i in range (START, END):
    ...
N3
#დაწყება, დასრულება, რა ნაბიჯით იმოძრავოს
for i in range(START, END, STEP):
    ...
'''
# დაჯამების კოდი
summ = 0
for i in range(11):
    summ += i
    print(summ)
