'N13. ერთმანეთში ჩაშენებული ფუნქციები'
def func1(x):
    def func2(y):
        print(x+y)
    return func2
'პირველი ფუნქციის და სულ ბოლოში, ხდება შიდა ფუნქციის გამოძახება'
# 10 მივიდა func1 "x" ის პოზიციაზე
'new=func1(10) მინიჭებული იყო გარე ფუნქცია def func1(x) და გადასცემს x '
new=func1(10)
print(new)
# 50 წაავიდა func2 'y' ის პოზიციაზე
new(50)
'გამოძახება new(50) მოხდა return func2, მეორე ფუნქციის გამოძახება'
'------------------------------------------------------------------------'
