'------------------------------------------------'
'N16. ფაილებთან მუშაობა'
'------------------------------------------------'
# w გადაწერს და ახალს არ  დაწერს
# a დაამატებს და ახალს მიუწერს
f= open("text.txt", "r")
print(f.read())
#r გახსნა რაც ეწერა წამაკითხა
f = open ("text.txt", "a")
f.write("\hello, david")
# ტექსტს ახალი ტექსტი მიამატა
f.close()

'------------------------------------------------'
#წაიკითხავს დაწერილ ტექსტს
f = open ("text.txt", "r")  #text= davit datunashvili
'r_ მითითების გარეშეც დეფოლტად კითხულობს'
#გამოიტანს წაკითხულს ტექსტს
print(f.read())
f.close()
'----------------------------------------'
# გამოიტანს ტექსტის 'davit' ნაწილს
f = open ("text.txt", "r")
print(f.read(5))
# დაასრულებს
f.close()
'----------------------------------------'
# გამოიტანს ტექსტის 'davit datunashvili' ნაწილს
f = open ("text.txt", "r")
print(f.readline())
# დაასრულებს
f.close()
'------------------------------------------------'
'ფოტოების და ბინარული ფაილების კოპირება,გადაწერა ან დაამატება'
# ბინარული ფაილის წაკითხვა
f1= open("picture.jpg", "rb")
# ბინარული არსებული ფოტო/ვიდეო გადაწერა ან დაწერა
f2=open("სურათი.jpg", "wb" )
f2.write(f1.read())
f1.close()
f2.close()
'--------------------------------------------'
# r+ წაიკითხავს და მერე დაამატებს ტექსტს
f = open ("text.txt", "r+")
# გამოიტანს რასაც წაიკითხავს
print(f.read())
# დაწერს ტექსტს
f.write("\heloaasda!")
#დაასრულებს
f.close()
'--------------------------------------------'
